
dict_value = {
    "_id": "http://www.iccchina.com/cost_target/detail/zeckhk",
    "model": "住宅",
    "工程指标": {
        "工程指标": {
            "人材机指标": {
                "主要人材机含量分析": [
                    {
                        "人材机名称": "  人工",
                        "单位": "工日/m2",
                        "单位消耗量": "4.233",
                        "计算口径": "6866.99",
                        "计算口径值": "建筑面积"
                    },
                    {
                        "人材机名称": "建筑",
                        "单位": "工日/m2",
                        "单位消耗量": "2.469",
                        "计算口径": "6866.99",
                        "计算口径值": "建筑面积"
                    },
                    {
                        "人材机名称": "装饰",
                        "单位": "工日/m2",
                        "单位消耗量": "1.237",
                        "计算口径": "6866.99",
                        "计算口径值": "建筑面积"
                    },
                    {
                        "人材机名称": "安装",
                        "单位": "工日/m2",
                        "单位消耗量": "0.527",
                        "计算口径": "6866.99",
                        "计算口径值": "建筑面积"
                    },
                    {
                        "人材机名称": "钢筋",
                        "单位": "kg/m2",
                        "单位消耗量": "35.884",
                        "计算口径": "6866.99",
                        "计算口径值": "建筑面积"
                    },
                    {
                        "人材机名称": "钢模板",
                        "单位": "kg/m2",
                        "单位消耗量": "0.0",
                        "计算口径": "6866.99",
                        "计算口径值": "建筑面积"
                    },
                    {
                        "人材机名称": "水泥",
                        "单位": "kg/m2",
                        "单位消耗量": "0.0",
                        "计算口径": "6866.99",
                        "计算口径值": "建筑面积"
                    },
                    {
                        "人材机名称": "砂子",
                        "单位": "m3/m2",
                        "单位消耗量": "0.0",
                        "计算口径": "6866.99",
                        "计算口径值": "建筑面积"
                    },
                    {
                        "人材机名称": "石子",
                        "单位": "m3/m2",
                        "单位消耗量": "0.0",
                        "计算口径": "6866.99",
                        "计算口径值": "建筑面积"
                    },
                    {
                        "人材机名称": "砌块",
                        "单位": "m3/m2",
                        "单位消耗量": "0.166",
                        "计算口径": "6866.99",
                        "计算口径值": "建筑面积"
                    },
                    {
                        "人材机名称": "混凝土",
                        "单位": "m3/m2",
                        "单位消耗量": "0.337",
                        "计算口径": "6866.99",
                        "计算口径值": "建筑面积"
                    },
                    {
                        "人材机名称": "门",
                        "单位": "m2/m2",
                        "单位消耗量": "0.0",
                        "计算口径": "6866.99",
                        "计算口径值": "建筑面积"
                    },
                    {
                        "人材机名称": "窗",
                        "单位": "m2/m2",
                        "单位消耗量": "0.0",
                        "计算口径": "6866.99",
                        "计算口径值": "建筑面积"
                    },
                    {
                        "人材机名称": "幕墙",
                        "单位": "m2/m2",
                        "单位消耗量": "0.0",
                        "计算口径": "6866.99",
                        "计算口径值": "建筑面积"
                    },
                    {
                        "人材机名称": "电线",
                        "单位": "m/m2",
                        "单位消耗量": "9.41",
                        "计算口径": "6866.99",
                        "计算口径值": "建筑面积"
                    },
                    {
                        "人材机名称": "电线管",
                        "单位": "m/m2",
                        "单位消耗量": "3.423",
                        "计算口径": "6866.99",
                        "计算口径值": "建筑面积"
                    },
                    {
                        "人材机名称": "电缆",
                        "单位": "m/m2",
                        "单位消耗量": "0.12",
                        "计算口径": "6866.99",
                        "计算口径值": "建筑面积"
                    },
                    {
                        "人材机名称": "桥架",
                        "单位": "m/m2",
                        "单位消耗量": "0.011",
                        "计算口径": "6866.99",
                        "计算口径值": "建筑面积"
                    },
                    {
                        "人材机名称": "配电箱",
                        "单位": "套/m2",
                        "单位消耗量": "0.009",
                        "计算口径": "6866.99",
                        "计算口径值": "建筑面积"
                    },
                    {
                        "人材机名称": "散热器",
                        "单位": "片/m2",
                        "单位消耗量": "0.0",
                        "计算口径": "6866.99",
                        "计算口径值": "建筑面积"
                    },
                    {
                        "人材机名称": "阀门",
                        "单位": "个/m2",
                        "单位消耗量": "0.001",
                        "计算口径": "6866.99",
                        "计算口径值": "建筑面积"
                    },
                    {
                        "人材机名称": "风管",
                        "单位": "m2/m2",
                        "单位消耗量": "0.0",
                        "计算口径": "6866.99",
                        "计算口径值": "建筑面积"
                    }
                ],
                "各专业人工消耗量分析": [
                    {
                        "人材机名称": "  人工消耗量",
                        "单位": "工日/m2",
                        "单位消耗量": "4.233",
                        "计算口径": "6866.99",
                        "计算口径值": "建筑面积"
                    },
                    {
                        "人材机名称": "  建筑人工耗量",
                        "单位": "工日/m2",
                        "单位消耗量": "2.469",
                        "计算口径": "6866.99",
                        "计算口径值": "建筑面积"
                    },
                    {
                        "人材机名称": "土（石）方工程",
                        "单位": "工日/m2",
                        "单位消耗量": "0.0",
                        "计算口径": "6866.99",
                        "计算口径值": "建筑面积"
                    },
                    {
                        "人材机名称": "砌筑工程",
                        "单位": "工日/m2",
                        "单位消耗量": "0.217",
                        "计算口径": "6866.99",
                        "计算口径值": "建筑面积"
                    },
                    {
                        "人材机名称": "混凝土工程",
                        "单位": "工日/m2",
                        "单位消耗量": "0.268",
                        "计算口径": "6866.99",
                        "计算口径值": "建筑面积"
                    },
                    {
                        "人材机名称": "钢筋工程",
                        "单位": "工日/m2",
                        "单位消耗量": "0.307",
                        "计算口径": "6866.99",
                        "计算口径值": "建筑面积"
                    },
                    {
                        "人材机名称": "模板工程",
                        "单位": "工日/m2",
                        "单位消耗量": "1.016",
                        "计算口径": "6866.99",
                        "计算口径值": "建筑面积"
                    },
                    {
                        "人材机名称": "金属结构工程",
                        "单位": "工日/m2",
                        "单位消耗量": "0.001",
                        "计算口径": "6866.99",
                        "计算口径值": "建筑面积"
                    },
                    {
                        "人材机名称": "屋面及防水工程",
                        "单位": "工日/m2",
                        "单位消耗量": "0.062",
                        "计算口径": "6866.99",
                        "计算口径值": "建筑面积"
                    },
                    {
                        "人材机名称": "防腐、隔热、保温工程",
                        "单位": "工日/m2",
                        "单位消耗量": "0.0",
                        "计算口径": "6866.99",
                        "计算口径值": "建筑面积"
                    },
                    {
                        "人材机名称": "  装饰人工",
                        "单位": "工日/m2",
                        "单位消耗量": "1.237",
                        "计算口径": "6866.99",
                        "计算口径值": "建筑面积"
                    },
                    {
                        "人材机名称": "楼地面工程",
                        "单位": "工日/m2",
                        "单位消耗量": "0.083",
                        "计算口径": "6866.99",
                        "计算口径值": "建筑面积"
                    },
                    {
                        "人材机名称": "墙柱面工程",
                        "单位": "工日/m2",
                        "单位消耗量": "1.028",
                        "计算口径": "6866.99",
                        "计算口径值": "建筑面积"
                    },
                    {
                        "人材机名称": "天棚工程",
                        "单位": "工日/m2",
                        "单位消耗量": "0.019",
                        "计算口径": "6866.99",
                        "计算口径值": "建筑面积"
                    },
                    {
                        "人材机名称": "门窗工程",
                        "单位": "工日/m2",
                        "单位消耗量": "0.0",
                        "计算口径": "6866.99",
                        "计算口径值": "建筑面积"
                    },
                    {
                        "人材机名称": "油漆、涂料、裱糊工程",
                        "单位": "工日/m2",
                        "单位消耗量": "0.108",
                        "计算口径": "6866.99",
                        "计算口径值": "建筑面积"
                    },
                    {
                        "人材机名称": "  安装人工",
                        "单位": "工日/m2",
                        "单位消耗量": "0.527",
                        "计算口径": "6866.99",
                        "计算口径值": "建筑面积"
                    },
                    {
                        "人材机名称": "给排水工程",
                        "单位": "工日/m2",
                        "单位消耗量": "0.162",
                        "计算口径": "6866.99",
                        "计算口径值": "建筑面积"
                    },
                    {
                        "人材机名称": "采暖工程",
                        "单位": "工日/m2",
                        "单位消耗量": "0.0",
                        "计算口径": "6866.99",
                        "计算口径值": "建筑面积"
                    },
                    {
                        "人材机名称": "通风空调工程",
                        "单位": "工日/m2",
                        "单位消耗量": "0.0",
                        "计算口径": "6866.99",
                        "计算口径值": "建筑面积"
                    },
                    {
                        "人材机名称": "强电工程",
                        "单位": "工日/m2",
                        "单位消耗量": "0.338",
                        "计算口径": "6866.99",
                        "计算口径值": "建筑面积"
                    },
                    {
                        "人材机名称": "弱电及智能化工程",
                        "单位": "工日/m2",
                        "单位消耗量": "0.026",
                        "计算口径": "6866.99",
                        "计算口径值": "建筑面积"
                    },
                    {
                        "人材机名称": "消防工程",
                        "单位": "工日/m2",
                        "单位消耗量": "0.0",
                        "计算口径": "6866.99",
                        "计算口径值": "建筑面积"
                    },
                    {
                        "人材机名称": "燃气工程",
                        "单位": "工日/m2",
                        "单位消耗量": "0.0",
                        "计算口径": "6866.99",
                        "计算口径值": "建筑面积"
                    },
                    {
                        "人材机名称": "电梯工程",
                        "单位": "工日/m2",
                        "单位消耗量": "0.0",
                        "计算口径": "6866.99",
                        "计算口径值": "建筑面积"
                    }
                ]
            },
            "技术指标": {
                "安装主要工程量指标表": [
                    {
                        "单位": "m/m2",
                        "单位含量": "0.118",
                        "科目名称": "电缆",
                        "计算口径": "建筑面积",
                        "计算口径值": "6866.99"
                    },
                    {
                        "单位": "m/m2",
                        "单位含量": "8.188",
                        "科目名称": "电气配线",
                        "计算口径": "建筑面积",
                        "计算口径值": "6866.99"
                    },
                    {
                        "单位": "m/m2",
                        "单位含量": "3.127",
                        "科目名称": "电气配管",
                        "计算口径": "建筑面积",
                        "计算口径值": "6866.99"
                    },
                    {
                        "单位": "m/m2",
                        "单位含量": "0.0",
                        "科目名称": "线槽",
                        "计算口径": "建筑面积",
                        "计算口径值": "6866.99"
                    },
                    {
                        "单位": "台/m2",
                        "单位含量": "0.0",
                        "科目名称": "变压器",
                        "计算口径": "建筑面积",
                        "计算口径值": "6866.99"
                    },
                    {
                        "单位": "台/m2",
                        "单位含量": "0.0",
                        "科目名称": "电动机",
                        "计算口径": "建筑面积",
                        "计算口径值": "6866.99"
                    },
                    {
                        "单位": "台/m2",
                        "单位含量": "0.009",
                        "科目名称": "配电箱",
                        "计算口径": "建筑面积",
                        "计算口径值": "6866.99"
                    },
                    {
                        "单位": "m/m2",
                        "单位含量": "0.011",
                        "科目名称": "桥架",
                        "计算口径": "建筑面积",
                        "计算口径值": "6866.99"
                    },
                    {
                        "单位": "m/m2",
                        "单位含量": "0.0",
                        "科目名称": "母线槽",
                        "计算口径": "建筑面积",
                        "计算口径值": "6866.99"
                    },
                    {
                        "单位": "套/m2",
                        "单位含量": "0.025",
                        "科目名称": "灯具",
                        "计算口径": "建筑面积",
                        "计算口径值": "6866.99"
                    },
                    {
                        "单位": "m/m2",
                        "单位含量": "0.723",
                        "科目名称": "  管道",
                        "计算口径": "建筑面积",
                        "计算口径值": "6866.99"
                    },
                    {
                        "单位": "m/m2",
                        "单位含量": "0.723",
                        "科目名称": "给排水管道",
                        "计算口径": "建筑面积",
                        "计算口径值": "6866.99"
                    },
                    {
                        "单位": "m/m2",
                        "单位含量": "0.0",
                        "科目名称": "采暖管道",
                        "计算口径": "建筑面积",
                        "计算口径值": "6866.99"
                    },
                    {
                        "单位": "m/m2",
                        "单位含量": "0.0",
                        "科目名称": "消防管道",
                        "计算口径": "建筑面积",
                        "计算口径值": "6866.99"
                    },
                    {
                        "单位": "台/m2",
                        "单位含量": "0.0",
                        "科目名称": "泵",
                        "计算口径": "建筑面积",
                        "计算口径值": "6866.99"
                    },
                    {
                        "单位": "片/m2",
                        "单位含量": "0.0",
                        "科目名称": "散热器",
                        "计算口径": "建筑面积",
                        "计算口径值": "6866.99"
                    },
                    {
                        "单位": "台/m2",
                        "单位含量": "0.0",
                        "科目名称": "风机盘管",
                        "计算口径": "建筑面积",
                        "计算口径值": "6866.99"
                    },
                    {
                        "单位": "个/m2",
                        "单位含量": "0.0",
                        "科目名称": "风口",
                        "计算口径": "建筑面积",
                        "计算口径值": "6866.99"
                    },
                    {
                        "单位": "m2/m2",
                        "单位含量": "0.0",
                        "科目名称": "风管",
                        "计算口径": "建筑面积",
                        "计算口径值": "6866.99"
                    },
                    {
                        "单位": "台/m2",
                        "单位含量": "0.0",
                        "科目名称": "风机",
                        "计算口径": "建筑面积",
                        "计算口径值": "6866.99"
                    },
                    {
                        "单位": "个/m2",
                        "单位含量": "0.0",
                        "科目名称": "灭火器",
                        "计算口径": "建筑面积",
                        "计算口径值": "6866.99"
                    },
                    {
                        "单位": "套/m2",
                        "单位含量": "0.0",
                        "科目名称": "消火栓",
                        "计算口径": "建筑面积",
                        "计算口径值": "6866.99"
                    },
                    {
                        "单位": "个/m2",
                        "单位含量": "0.0",
                        "科目名称": "喷淋头",
                        "计算口径": "建筑面积",
                        "计算口径值": "6866.99"
                    },
                    {
                        "单位": "个/m2",
                        "单位含量": "0.0",
                        "科目名称": "探测器",
                        "计算口径": "建筑面积",
                        "计算口径值": "6866.99"
                    },
                    {
                        "单位": "台/m2",
                        "单位含量": "0.0",
                        "科目名称": "灶具",
                        "计算口径": "建筑面积",
                        "计算口径值": "6866.99"
                    }
                ],
                "建筑装饰工程量指标表": [
                    {
                        "单位": "m3/m2",
                        "单位含量": "0.007",
                        "科目名称": "挖基础土方",
                        "计算口径": "建筑面积",
                        "计算口径值": "6866.99"
                    },
                    {
                        "单位": "m3/m2",
                        "单位含量": "0.006",
                        "科目名称": "土（石）方回填",
                        "计算口径": "建筑面积",
                        "计算口径值": "6866.99"
                    },
                    {
                        "单位": "m3/m2",
                        "单位含量": "0.16",
                        "科目名称": "砌体",
                        "计算口径": "建筑面积",
                        "计算口径值": "6866.99"
                    },
                    {
                        "单位": "m3/m2",
                        "单位含量": "0.327",
                        "科目名称": "  混凝土",
                        "计算口径": "建筑面积",
                        "计算口径值": "6866.99"
                    },
                    {
                        "单位": "m3/m2",
                        "单位含量": "0.013",
                        "科目名称": "柱混凝土量",
                        "计算口径": "建筑面积",
                        "计算口径值": "6866.99"
                    },
                    {
                        "单位": "m3/m2",
                        "单位含量": "0.012",
                        "科目名称": "梁混凝土量",
                        "计算口径": "建筑面积",
                        "计算口径值": "6866.99"
                    },
                    {
                        "单位": "m3/m2",
                        "单位含量": "0.125",
                        "科目名称": "墙混凝土量",
                        "计算口径": "建筑面积",
                        "计算口径值": "6866.99"
                    },
                    {
                        "单位": "m3/m2",
                        "单位含量": "0.162",
                        "科目名称": "板混凝土量",
                        "计算口径": "建筑面积",
                        "计算口径值": "6866.99"
                    },
                    {
                        "单位": "m3/m2",
                        "单位含量": "0.011",
                        "科目名称": "楼梯混凝土量",
                        "计算口径": "建筑面积",
                        "计算口径值": "6866.99"
                    },
                    {
                        "单位": "m3/m2",
                        "单位含量": "0.0",
                        "科目名称": "后浇带混凝土量",
                        "计算口径": "建筑面积",
                        "计算口径值": "6866.99"
                    },
                    {
                        "单位": "m3/m2",
                        "单位含量": "0.0",
                        "科目名称": "基础混凝土量",
                        "计算口径": "建筑面积",
                        "计算口径值": "6866.99"
                    },
                    {
                        "单位": "kg/m2",
                        "单位含量": "32.734",
                        "科目名称": "钢筋",
                        "计算口径": "建筑面积",
                        "计算口径值": "6866.99"
                    },
                    {
                        "单位": "m2/m2",
                        "单位含量": "3.164",
                        "科目名称": "模板",
                        "计算口径": "建筑面积",
                        "计算口径值": "6866.99"
                    },
                    {
                        "单位": "m2/m2",
                        "单位含量": "0.077",
                        "科目名称": "屋面防水",
                        "计算口径": "建筑面积",
                        "计算口径值": "6866.99"
                    },
                    {
                        "单位": "m2/m2",
                        "单位含量": "0.0",
                        "科目名称": "墙地面防水",
                        "计算口径": "建筑面积",
                        "计算口径值": "6866.99"
                    },
                    {
                        "单位": "m2/m2",
                        "单位含量": "0.0",
                        "科目名称": "保温隔热",
                        "计算口径": "建筑面积",
                        "计算口径值": "6866.99"
                    },
                    {
                        "单位": "m2/m2",
                        "单位含量": "0.841",
                        "科目名称": "楼地面装饰",
                        "计算口径": "建筑面积",
                        "计算口径值": "6866.99"
                    },
                    {
                        "单位": "m2/m2",
                        "单位含量": "3.461",
                        "科目名称": "墙柱面装饰",
                        "计算口径": "建筑面积",
                        "计算口径值": "6866.99"
                    },
                    {
                        "单位": "m2/m2",
                        "单位含量": "0.0",
                        "科目名称": "幕墙",
                        "计算口径": "建筑面积",
                        "计算口径值": "6866.99"
                    },
                    {
                        "单位": "m2/m2",
                        "单位含量": "0.783",
                        "科目名称": "天棚装饰",
                        "计算口径": "建筑面积",
                        "计算口径值": "6866.99"
                    }
                ]
            },
            "经济指标": {
                "分部分项造价分析": [
                    {
                        "单位": "元/m2",
                        "占造价比例": "1.0",
                        "平方米造价": "1258.099",
                        "科目名称": "  单项工程",
                        "计算口径值": "6866.99"
                    },
                    {
                        "单位": "元/m2",
                        "占造价比例": "0.3131",
                        "平方米造价": "393.921",
                        "科目名称": "  建筑工程",
                        "计算口径值": "6866.99"
                    },
                    {
                        "单位": "元/m2",
                        "占造价比例": "0.0",
                        "平方米造价": "0.0",
                        "科目名称": "土石方工程",
                        "计算口径值": "6866.99"
                    },
                    {
                        "单位": "元/m2",
                        "占造价比例": "0.0",
                        "平方米造价": "0.0",
                        "科目名称": "地基处理与边坡支护工程",
                        "计算口径值": "6866.99"
                    },
                    {
                        "单位": "元/m2",
                        "占造价比例": "0.0",
                        "平方米造价": "0.0",
                        "科目名称": "桩基工程",
                        "计算口径值": "6866.99"
                    },
                    {
                        "单位": "元/m2",
                        "占造价比例": "0.1712",
                        "平方米造价": "67.431",
                        "科目名称": "砌筑工程",
                        "计算口径值": "6866.99"
                    },
                    {
                        "单位": "元/m2",
                        "占造价比例": "0.3511",
                        "平方米造价": "138.313",
                        "科目名称": "混凝土工程",
                        "计算口径值": "6866.99"
                    },
                    {
                        "单位": "元/m2",
                        "占造价比例": "0.4068",
                        "平方米造价": "160.263",
                        "科目名称": "钢筋工程",
                        "计算口径值": "6866.99"
                    },
                    {
                        "单位": "元/m2",
                        "占造价比例": "0.0",
                        "平方米造价": "0.0",
                        "科目名称": "木结构工程",
                        "计算口径值": "6866.99"
                    },
                    {
                        "单位": "元/m2",
                        "占造价比例": "0.0012",
                        "平方米造价": "0.467",
                        "科目名称": "金属结构工程",
                        "计算口径值": "6866.99"
                    },
                    {
                        "单位": "元/m2",
                        "占造价比例": "0.0423",
                        "平方米造价": "16.653",
                        "科目名称": "屋面及防水工程",
                        "计算口径值": "6866.99"
                    },
                    {
                        "单位": "元/m2",
                        "占造价比例": "0.0",
                        "平方米造价": "0.0",
                        "科目名称": "保温、隔热、防腐工程",
                        "计算口径值": "6866.99"
                    },
                    {
                        "单位": "元/m2",
                        "占造价比例": "0.0",
                        "平方米造价": "0.0",
                        "科目名称": "拆除工程",
                        "计算口径值": "6866.99"
                    },
                    {
                        "单位": "元/m2",
                        "占造价比例": "0.2115",
                        "平方米造价": "266.06",
                        "科目名称": "  装饰装修工程",
                        "计算口径值": "6866.99"
                    },
                    {
                        "单位": "元/m2",
                        "占造价比例": "0.0906",
                        "平方米造价": "24.098",
                        "科目名称": "楼地面工程",
                        "计算口径值": "6866.99"
                    },
                    {
                        "单位": "元/m2",
                        "占造价比例": "0.6282",
                        "平方米造价": "167.141",
                        "科目名称": "墙、柱面装饰与隔断、幕墙工程",
                        "计算口径值": "6866.99"
                    },
                    {
                        "单位": "元/m2",
                        "占造价比例": "0.0099",
                        "平方米造价": "2.637",
                        "科目名称": "天棚工程",
                        "计算口径值": "6866.99"
                    },
                    {
                        "单位": "元/m2",
                        "占造价比例": "0.0",
                        "平方米造价": "0.0",
                        "科目名称": "门窗工程",
                        "计算口径值": "6866.99"
                    },
                    {
                        "单位": "元/m2",
                        "占造价比例": "0.2713",
                        "平方米造价": "72.183",
                        "科目名称": "油漆、涂料、裱糊工程",
                        "计算口径值": "6866.99"
                    },
                    {
                        "单位": "元/m2",
                        "占造价比例": "0.0",
                        "平方米造价": "0.0",
                        "科目名称": "其他工程",
                        "计算口径值": "6866.99"
                    },
                    {
                        "单位": "元/m2",
                        "占造价比例": "0.08",
                        "平方米造价": "100.659",
                        "科目名称": "  安装工程",
                        "计算口径值": "6866.99"
                    },
                    {
                        "单位": "元/m2",
                        "占造价比例": "0.2244",
                        "平方米造价": "22.591",
                        "科目名称": "  给排水工程",
                        "计算口径值": "6866.99"
                    },
                    {
                        "单位": "元/m2",
                        "占造价比例": "0.8851",
                        "平方米造价": "19.997",
                        "科目名称": "其中：管道及附件安装",
                        "计算口径值": "6866.99"
                    },
                    {
                        "单位": "元/m2",
                        "占造价比例": "0.0",
                        "平方米造价": "0.0",
                        "科目名称": "其中：卫生器具",
                        "计算口径值": "6866.99"
                    },
                    {
                        "单位": "元/m2",
                        "占造价比例": "0.0",
                        "平方米造价": "0.0",
                        "科目名称": "  采暖工程",
                        "计算口径值": "6866.99"
                    },
                    {
                        "单位": "元/m2",
                        "占造价比例": "6866.99",
                        "平方米造价": "0.0",
                        "科目名称": "其中：管道及附件安装"
                    },
                    {
                        "单位": "元/m2",
                        "占造价比例": "6866.99",
                        "平方米造价": "0.0",
                        "科目名称": "其中：供暖器具"
                    },
                    {
                        "单位": "元/m2",
                        "占造价比例": "0.7336",
                        "平方米造价": "73.845",
                        "科目名称": "  电气工程",
                        "计算口径值": "6866.99"
                    },
                    {
                        "单位": "元/m2",
                        "占造价比例": "0.7476",
                        "平方米造价": "55.204",
                        "科目名称": "其中：配管、配线",
                        "计算口径值": "6866.99"
                    },
                    {
                        "单位": "元/m2",
                        "占造价比例": "0.0894",
                        "平方米造价": "6.6",
                        "科目名称": "其中：电缆安装",
                        "计算口径值": "6866.99"
                    },
                    {
                        "单位": "元/m2",
                        "占造价比例": "0.0226",
                        "平方米造价": "1.666",
                        "科目名称": "其中：照明器具",
                        "计算口径值": "6866.99"
                    },
                    {
                        "单位": "元/m2",
                        "占造价比例": "0.0",
                        "平方米造价": "0.0",
                        "科目名称": "通风空调工程",
                        "计算口径值": "6866.99"
                    },
                    {
                        "单位": "元/m2",
                        "占造价比例": "0.0",
                        "平方米造价": "0.0",
                        "科目名称": "燃气工程",
                        "计算口径值": "6866.99"
                    },
                    {
                        "单位": "元/m2",
                        "占造价比例": "0.042",
                        "平方米造价": "4.223",
                        "科目名称": "弱电及智能化工程",
                        "计算口径值": "6866.99"
                    },
                    {
                        "单位": "元/m2",
                        "占造价比例": "0.0",
                        "平方米造价": "0.0",
                        "科目名称": "消防工程",
                        "计算口径值": "6866.99"
                    },
                    {
                        "单位": "元/m2",
                        "占造价比例": "0.0",
                        "平方米造价": "0.0",
                        "科目名称": "电梯工程",
                        "计算口径值": "6866.99"
                    },
                    {
                        "单位": "元/m2",
                        "占造价比例": "0.2355",
                        "平方米造价": "296.327",
                        "科目名称": "措施项目费",
                        "计算口径值": "6866.99"
                    },
                    {
                        "单位": "元/m2",
                        "占造价比例": "0.0",
                        "平方米造价": "0.0",
                        "科目名称": "其他项目费",
                        "计算口径值": "6866.99"
                    },
                    {
                        "单位": "元/m2",
                        "占造价比例": "0.0608",
                        "平方米造价": "76.456",
                        "科目名称": "规费",
                        "计算口径值": "6866.99"
                    },
                    {
                        "单位": "元/m2",
                        "占造价比例": "0.0991",
                        "平方米造价": "124.677",
                        "科目名称": "税金",
                        "计算口径值": "6866.99"
                    },
                    {
                        "单位": "元/m2",
                        "占造价比例": "0.0",
                        "平方米造价": "0.0",
                        "科目名称": "其他取费",
                        "计算口径值": "6866.99"
                    },
                    {
                        "单位": "元/m2",
                        "占造价比例": "0.0",
                        "平方米造价": "0.0",
                        "科目名称": "甲供材料费",
                        "计算口径值": "6866.99"
                    },
                    {
                        "单位": "元/m2",
                        "占造价比例": "0.0",
                        "平方米造价": "0.0",
                        "科目名称": "价差",
                        "计算口径值": "6866.99"
                    }
                ],
                "各专业造价构成指标表": [
                    {
                        "单位": "元/m2",
                        "占造价比例": "1.0",
                        "平方米造价": "1258.099",
                        "科目名称": "  单项工程",
                        "计算口径值": "6866.99"
                    },
                    {
                        "单位": "元/m2",
                        "占造价比例": "0.691",
                        "平方米造价": "869.279",
                        "科目名称": "建筑工程",
                        "计算口径值": "6866.99"
                    },
                    {
                        "单位": "元/m2",
                        "占造价比例": "0.211",
                        "平方米造价": "266.06",
                        "科目名称": "装饰工程",
                        "计算口径值": "6866.99"
                    },
                    {
                        "单位": "元/m2",
                        "占造价比例": "0.018",
                        "平方米造价": "22.591",
                        "科目名称": "给排水工程",
                        "计算口径值": "6866.99"
                    },
                    {
                        "单位": "元/m2",
                        "占造价比例": "0.0",
                        "平方米造价": "0.0",
                        "科目名称": "采暖工程",
                        "计算口径值": "6866.99"
                    },
                    {
                        "单位": "元/m2",
                        "占造价比例": "0.0",
                        "平方米造价": "0.0",
                        "科目名称": "通风空调工程",
                        "计算口径值": "6866.99"
                    },
                    {
                        "单位": "元/m2",
                        "占造价比例": "0.076",
                        "平方米造价": "95.946",
                        "科目名称": "强电工程",
                        "计算口径值": "6866.99"
                    },
                    {
                        "单位": "元/m2",
                        "占造价比例": "0.003",
                        "平方米造价": "4.223",
                        "科目名称": "弱电及智能化工程",
                        "计算口径值": "6866.99"
                    },
                    {
                        "单位": "元/m2",
                        "占造价比例": "0.0",
                        "平方米造价": "0.0",
                        "科目名称": "消防工程",
                        "计算口径值": "6866.99"
                    },
                    {
                        "单位": "元/m2",
                        "占造价比例": "0.0",
                        "平方米造价": "0.0",
                        "科目名称": "燃气工程",
                        "计算口径值": "6866.99"
                    },
                    {
                        "单位": "元/m2",
                        "占造价比例": "0.0",
                        "平方米造价": "0.0",
                        "科目名称": "电梯工程",
                        "计算口径值": "6866.99"
                    }
                ],
                "造价费用指标表": [
                    {
                        "单位": "元/m2",
                        "占造价比例": "1.0",
                        "平方米造价": "1258.099",
                        "科目名称": "  单项工程",
                        "计算口径值": "6866.99"
                    },
                    {
                        "单位": "元/m2",
                        "占造价比例": "0.6046",
                        "平方米造价": "760.64",
                        "科目名称": "  分部分项工程费",
                        "计算口径值": "6866.99"
                    },
                    {
                        "单位": "元/m2",
                        "占造价比例": "0.5179",
                        "平方米造价": "393.921",
                        "科目名称": "建筑工程",
                        "计算口径值": "6866.99"
                    },
                    {
                        "单位": "元/m2",
                        "占造价比例": "0.3498",
                        "平方米造价": "266.06",
                        "科目名称": "装饰装修工程",
                        "计算口径值": "6866.99"
                    },
                    {
                        "单位": "元/m2",
                        "占造价比例": "0.1323",
                        "平方米造价": "100.659",
                        "科目名称": "安装工程",
                        "计算口径值": "6866.99"
                    },
                    {
                        "单位": "元/m2",
                        "占造价比例": "0.2355",
                        "平方米造价": "296.327",
                        "科目名称": "措施项目费",
                        "计算口径值": "6866.99"
                    },
                    {
                        "单位": "元/m2",
                        "占造价比例": "0.0",
                        "平方米造价": "0.0",
                        "科目名称": "其他项目费",
                        "计算口径值": "6866.99"
                    },
                    {
                        "单位": "元/m2",
                        "占造价比例": "0.0608",
                        "平方米造价": "76.456",
                        "科目名称": "规费",
                        "计算口径值": "6866.99"
                    },
                    {
                        "单位": "元/m2",
                        "占造价比例": "0.0991",
                        "平方米造价": "124.677",
                        "科目名称": "税金",
                        "计算口径值": "6866.99"
                    },
                    {
                        "单位": "元/m2",
                        "占造价比例": "0.0",
                        "平方米造价": "0.0",
                        "科目名称": "其他取费",
                        "计算口径值": "6866.99"
                    },
                    {
                        "单位": "元/m2",
                        "占造价比例": "0.0",
                        "平方米造价": "0.0",
                        "科目名称": "甲供材料费",
                        "计算口径值": "6866.99"
                    },
                    {
                        "单位": "元/m2",
                        "占造价比例": "0.0",
                        "平方米造价": "0.0",
                        "科目名称": "价差",
                        "计算口径值": "6866.99"
                    }
                ]
            }
        }
    },
    "工程概况": {
        "NONE": "NONE",
        "价格取定期": "\n        \n        2018/04/01\n        \n      ",
        "地上层数": "13",
        "地下层数": "NONE",
        "基础形式": "NONE",
        "工程类型": "住宅>别墅（含独栋、双拼和联排）",
        "建筑长度": "NONE",
        "建筑面积": "6866.99m²",
        "所在地区": "湖北省-武汉市",
        "抗震设防烈度": "6度",
        "结构类型": "框架剪力墙结构",
        "编制依据": "工程量清单项目计量规范(2013-湖北），湖北省通用安装工程消耗量定额及单位估价表(2013),湖北省房屋建筑与装饰工程消耗量定额及基价表(2013)",
        "计价类别": "清单计价",
        "造价": "￥1258.1/m²",
        "造价类别": "中标价",
        "项目名称": "武汉某高层住宅小区造价指标"
    },
    "工程特征": {
        "工程特征": {
            "建筑工程基本特征": [
                {
                    "特征值": "不包含",
                    "特征项": "土（石）方工程"
                },
                {
                    "特征值": "不包含",
                    "特征项": "基坑支护"
                },
                {
                    "特征值": "不包含",
                    "特征项": "降水工程"
                },
                {
                    "特征值": "不包含",
                    "特征项": "地基处理"
                },
                {
                    "特征值": "不包含",
                    "特征项": "基础类型"
                },
                {
                    "特征值": "包含混凝土工程和钢筋工程；商品混凝土C20~30;三级钢占比94.67%",
                    "特征项": "钢筋混凝土结构工程"
                },
                {
                    "特征值": "蒸压灰砂砖；蒸压砂加气混凝土砌块",
                    "特征项": "砌筑工程"
                },
                {
                    "特征值": "JS-Ⅰ型防水涂料；自粘聚合物改性沥青防水卷材（PY-Ⅰ型）",
                    "特征项": "防水工程"
                },
                {
                    "特征值": "挤塑聚苯乙烯泡沫塑料板X350型（B1级）",
                    "特征项": "防腐、隔热、保温工程"
                },
                {
                    "特征值": "不包含",
                    "特征项": "特种门"
                },
                {
                    "特征值": "零星钢构件",
                    "特征项": "金属结构工程"
                },
                {
                    "特征值": "涂料",
                    "特征项": "外立面材质"
                },
                {
                    "特征值": "抹灰,涂料",
                    "特征项": "室内装修材质"
                },
                {
                    "特征值": "不包含",
                    "特征项": "门"
                },
                {
                    "特征值": "不包含",
                    "特征项": "窗"
                },
                {
                    "特征值": "不包含",
                    "特征项": "屋面装饰"
                },
                {
                    "特征值": "包含给水系统，排水系统；给水管：PP-R塑料给水管DN15~20；排水管：UPVC塑料排水管DN25~100",
                    "特征项": "给排水工程"
                },
                {
                    "特征值": "不包含",
                    "特征项": "燃气工程"
                },
                {
                    "特征值": "不包含",
                    "特征项": "采暖工程"
                },
                {
                    "特征值": "包含动力系统，照明系统，防雷接地系统；电缆：WDZ-YJY,BTTY,YFD-BTTY,；电线：WDZ-BYJ-2.5~4,WDZN-BYJ-2.5；电线管：塑料管PC20~40,JDG20~25,SC20~40；照明配电箱，动力配电箱；灯具",
                    "特征项": "强电工程"
                },
                {
                    "特征值": "不包含",
                    "特征项": "通风空调工程"
                },
                {
                    "特征值": "不包含",
                    "特征项": "消防工程"
                },
                {
                    "特征值": "综合布线系统",
                    "特征项": "智能化系统"
                },
                {
                    "特征值": "不含电梯",
                    "特征项": "电梯数量"
                }
            ]
        }
    }
}
def getpath(nested_dict,prepath=None):
    if not prepath:
        prepath = ()
    for k,v in nested_dict.items():
        path = prepath + (k,)
        if not isinstance(v,dict): # found value
            yield path # yield the value
        elif hasattr(v, 'items'):
            yield from getpath(v,path) # yield all paths from recursive call

for path in getpath(dict_value):
    print(list(path))