import json
import os
import re
import xlwt


dict_value = {
    "工程指标": {
        "工程指标": {
            "人材机指标": {
                "主要消耗量指标": [
                    {
                        "单位": "工日",
                        "消耗量": "16692.62",
                        "百平方米消耗量": "172.92",
                        "项  目  名 称": "建筑"
                    },
                    {
                        "单位": "工日",
                        "消耗量": "13150.97",
                        "百平方米消耗量": "136.23",
                        "项  目  名 称": "装饰"
                    },
                    {
                        "单位": "工日",
                        "消耗量": "8374.78",
                        "百平方米消耗量": "86.75",
                        "项  目  名 称": "安装"
                    },
                    {
                        "单位": "工日",
                        "消耗量": "38218.37",
                        "百平方米消耗量": "395.9",
                        "项  目  名 称": "小计"
                    },
                    {
                        "单位": "千克",
                        "消耗量": "730037.09",
                        "百平方米消耗量": "7562.34",
                        "项  目  名 称": "钢    筋"
                    },
                    {
                        "单位": "千克",
                        "消耗量": "-",
                        "百平方米消耗量": "-",
                        "项  目  名 称": "钢 模 板"
                    },
                    {
                        "单位": "千克",
                        "消耗量": "4870.0",
                        "百平方米消耗量": "50.45",
                        "项  目  名 称": "其他钢材"
                    },
                    {
                        "单位": "平方米",
                        "消耗量": "33817.64",
                        "百平方米消耗量": "350.31",
                        "项  目  名 称": "木 模 板"
                    },
                    {
                        "单位": "千克",
                        "消耗量": "-",
                        "百平方米消耗量": "-",
                        "项  目  名 称": "水    泥"
                    },
                    {
                        "单位": "千克",
                        "消耗量": "-",
                        "百平方米消耗量": "-",
                        "项  目  名 称": "黄    砂"
                    },
                    {
                        "单位": "千克",
                        "消耗量": "-",
                        "百平方米消耗量": "-",
                        "项  目  名 称": "石    子"
                    },
                    {
                        "单位": "千块",
                        "消耗量": "-",
                        "百平方米消耗量": "-",
                        "项  目  名 称": "多 孔 砖"
                    },
                    {
                        "单位": "立方米",
                        "消耗量": "1347.85",
                        "百平方米消耗量": "13.96",
                        "项  目  名 称": "砌    块"
                    },
                    {
                        "单位": "立方米",
                        "消耗量": "4913.37",
                        "百平方米消耗量": "50.9",
                        "项  目  名 称": "商 品 砼"
                    },
                    {
                        "单位": "立方米",
                        "消耗量": "686.94",
                        "百平方米消耗量": "7.12",
                        "项  目  名 称": "预拌砂浆"
                    }
                ]
            },
            "技术指标": {
                "建筑装饰工程量指标表": [
                    {
                        "项 目 名 称": "工程量"
                    },
                    {
                        "单位": "立方米",
                        "工程量": "2876.93",
                        "百平方米": "29.8",
                        "项 目 名 称": "土（石）方工程"
                    },
                    {
                        "单位": "短桩",
                        "工程量": "立方米",
                        "百平方米": "-",
                        "项 目 名 称": "桩基工程"
                    },
                    {
                        "单位": "千克",
                        "工程量": "-",
                        "百平方米": "-",
                        "项 目 名 称": "钢管桩"
                    },
                    {
                        "单位": "立方米",
                        "工程量": "4101.0",
                        "百平方米": "42.48",
                        "项 目 名 称": "砼方桩"
                    },
                    {
                        "单位": "立方米",
                        "工程量": "-",
                        "百平方米": "-",
                        "项 目 名 称": "砼管桩"
                    },
                    {
                        "单位": "米",
                        "工程量": "-",
                        "百平方米": "-",
                        "项 目 名 称": "灌注桩"
                    },
                    {
                        "单位": "立方米",
                        "工程量": "-",
                        "百平方米": "-",
                        "项 目 名 称": "其他"
                    },
                    {
                        "单位": "砖基础",
                        "工程量": "立方米",
                        "百平方米": "-",
                        "项 目 名 称": "砌筑工程"
                    },
                    {
                        "单位": "立方米",
                        "工程量": "180.31",
                        "百平方米": "1.87",
                        "项 目 名 称": "外墙砌体"
                    },
                    {
                        "单位": "立方米",
                        "工程量": "1128.44",
                        "百平方米": "11.69",
                        "项 目 名 称": "内墙砌体"
                    },
                    {
                        "单位": "基础（除地下室）",
                        "工程量": "立方米",
                        "百平方米": "761.11",
                        "项 目 名 称": "混凝土工程"
                    },
                    {
                        "单位": "立方米",
                        "工程量": "414.6",
                        "百平方米": "4.29",
                        "项 目 名 称": "地下"
                    },
                    {
                        "单位": "立方米",
                        "工程量": "3665.05",
                        "百平方米": "37.97",
                        "项 目 名 称": "地上"
                    },
                    {
                        "单位": "吨",
                        "工程量": "722.81",
                        "百平方米": "7.49",
                        "项 目 名 称": "钢筋工程"
                    },
                    {
                        "单位": "平方米",
                        "工程量": "33658.14",
                        "百平方米": "348.66",
                        "项 目 名 称": "模板工程"
                    },
                    {
                        "单位": "门",
                        "工程量": "平方米",
                        "百平方米": "2810.78",
                        "项 目 名 称": "门窗工程"
                    },
                    {
                        "单位": "平方米",
                        "工程量": "504.82",
                        "百平方米": "5.23",
                        "项 目 名 称": "窗"
                    },
                    {
                        "单位": "平方米",
                        "工程量": "300.3",
                        "百平方米": "3.11",
                        "项 目 名 称": "其他"
                    },
                    {
                        "单位": "块料面层",
                        "工程量": "平方米",
                        "百平方米": "7626.39",
                        "项 目 名 称": "楼地面工程"
                    },
                    {
                        "单位": "平方米",
                        "工程量": "2284.17",
                        "百平方米": "23.66",
                        "项 目 名 称": "整体面层"
                    },
                    {
                        "单位": "平方米",
                        "工程量": "-",
                        "百平方米": "-",
                        "项 目 名 称": "其他"
                    },
                    {
                        "单位": "屋面防水",
                        "工程量": "平方米",
                        "百平方米": "947.79",
                        "项 目 名 称": "屋面工程"
                    },
                    {
                        "单位": "平方米",
                        "工程量": "588.26",
                        "百平方米": "6.09",
                        "项 目 名 称": "隔热保温"
                    },
                    {
                        "单位": "幕墙",
                        "工程量": "平方米",
                        "百平方米": "-",
                        "项 目 名 称": "外装饰工程"
                    },
                    {
                        "单位": "平方米",
                        "工程量": "6020.68",
                        "百平方米": "62.37",
                        "项 目 名 称": "涂料"
                    },
                    {
                        "单位": "平方米",
                        "工程量": "4402.14",
                        "百平方米": "45.6",
                        "项 目 名 称": "块料"
                    },
                    {
                        "单位": "平方米",
                        "工程量": "3301.93",
                        "百平方米": "34.2",
                        "项 目 名 称": "外保温"
                    },
                    {
                        "单位": "平方米",
                        "工程量": "-",
                        "百平方米": "-",
                        "项 目 名 称": "其他"
                    },
                    {
                        "单位": "内墙饰面",
                        "工程量": "平方米",
                        "百平方米": "20399.0",
                        "项 目 名 称": "内装饰工程"
                    },
                    {
                        "单位": "平方米",
                        "工程量": "7749.18",
                        "百平方米": "80.27",
                        "项 目 名 称": "天棚"
                    },
                    {
                        "单位": "平方米",
                        "工程量": "3301.93",
                        "百平方米": "34.2",
                        "项 目 名 称": "内保温"
                    },
                    {
                        "单位": "平方米",
                        "工程量": "-",
                        "百平方米": "-",
                        "项 目 名 称": "其他"
                    },
                    {
                        "单位": "吨",
                        "工程量": "-",
                        "百平方米": "-",
                        "项 目 名 称": "金属结构工程"
                    }
                ]
            },
            "经济指标": {
                "其他项目造价指标": [
                    {
                        "平方米造价             （元/m2）": "-",
                        "造价(万元)": "-",
                        "造价比例（%）": "-",
                        "项目名称": "暂列金额项目"
                    },
                    {
                        "平方米造价             （元/m2）": "-",
                        "造价(万元)": "-",
                        "造价比例（%）": "-",
                        "项目名称": "专业工程暂估价项目"
                    },
                    {
                        "平方米造价             （元/m2）": "-",
                        "造价(万元)": "-",
                        "造价比例（%）": "-",
                        "项目名称": "计日工"
                    },
                    {
                        "平方米造价             （元/m2）": "3.31",
                        "造价(万元)": "3.2",
                        "造价比例（%）": "0.12",
                        "项目名称": "总承包服务费"
                    }
                ],
                "分部分项工程造价指标": [
                    {
                        "平方米造价             （元/m2）": "914.93",
                        "造价(万元)": "883.24",
                        "造价比例（%）": "33.65",
                        "项目名称": "建筑工程"
                    },
                    {
                        "平方米造价             （元/m2）": "17.08",
                        "造价(万元)": "16.49",
                        "造价比例（%）": "0.63",
                        "项目名称": "土（石）方工程"
                    },
                    {
                        "平方米造价             （元/m2）": "113.32",
                        "造价(万元)": "109.39",
                        "造价比例（%）": "4.17",
                        "项目名称": "桩与地基基础工程"
                    },
                    {
                        "平方米造价             （元/m2）": "65.95",
                        "造价(万元)": "63.67",
                        "造价比例（%）": "2.43",
                        "项目名称": "砌筑工程"
                    },
                    {
                        "平方米造价             （元/m2）": "636.48",
                        "造价(万元)": "614.43",
                        "造价比例（%）": "23.41",
                        "项目名称": "混凝土及钢筋混凝土工程"
                    },
                    {
                        "平方米造价             （元/m2）": "-",
                        "造价(万元)": "-",
                        "造价比例（%）": "-",
                        "项目名称": "厂库房大门、特种门、木结构工程"
                    },
                    {
                        "平方米造价             （元/m2）": "-",
                        "造价(万元)": "-",
                        "造价比例（%）": "-",
                        "项目名称": "金属结构工程"
                    },
                    {
                        "平方米造价             （元/m2）": "18.83",
                        "造价(万元)": "18.18",
                        "造价比例（%）": "0.69",
                        "项目名称": "屋面及防水工程"
                    },
                    {
                        "平方米造价             （元/m2）": "63.27",
                        "造价(万元)": "61.08",
                        "造价比例（%）": "2.33",
                        "项目名称": "防腐、隔热、保温工程"
                    },
                    {
                        "平方米造价             （元/m2）": "-",
                        "造价(万元)": "-",
                        "造价比例（%）": "-",
                        "项目名称": "其他工程"
                    },
                    {
                        "平方米造价             （元/m2）": "664.31",
                        "造价(万元)": "641.3",
                        "造价比例（%）": "24.43",
                        "项目名称": "装饰装修工程"
                    },
                    {
                        "平方米造价             （元/m2）": "123.36",
                        "造价(万元)": "119.09",
                        "造价比例（%）": "4.54",
                        "项目名称": "楼地面工程"
                    },
                    {
                        "平方米造价             （元/m2）": "194.54",
                        "造价(万元)": "187.8",
                        "造价比例（%）": "7.15",
                        "项目名称": "门窗工程"
                    },
                    {
                        "平方米造价             （元/m2）": "190.68",
                        "造价(万元)": "184.07",
                        "造价比例（%）": "7.01",
                        "项目名称": "墙柱面工程"
                    },
                    {
                        "平方米造价             （元/m2）": "46.27",
                        "造价(万元)": "44.67",
                        "造价比例（%）": "1.7",
                        "项目名称": "天棚工程"
                    },
                    {
                        "平方米造价             （元/m2）": "82.28",
                        "造价(万元)": "79.43",
                        "造价比例（%）": "3.03",
                        "项目名称": "油漆、涂料、裱糊工程"
                    },
                    {
                        "平方米造价             （元/m2）": "27.18",
                        "造价(万元)": "26.24",
                        "造价比例（%）": "1.0",
                        "项目名称": "其他工程"
                    },
                    {
                        "平方米造价             （元/m2）": "608.68",
                        "造价(万元)": "587.59",
                        "造价比例（%）": "22.38",
                        "项目名称": "安装工程"
                    },
                    {
                        "平方米造价             （元/m2）": "259.29",
                        "造价(万元)": "250.31",
                        "造价比例（%）": "9.54",
                        "项目名称": "电气工程"
                    },
                    {
                        "平方米造价             （元/m2）": "189.91",
                        "造价(万元)": "183.33",
                        "造价比例（%）": "6.98",
                        "项目名称": "给排水、采暖、燃气工程"
                    },
                    {
                        "平方米造价             （元/m2）": "64.77",
                        "造价(万元)": "62.53",
                        "造价比例（%）": "2.38",
                        "项目名称": "消防工程"
                    },
                    {
                        "平方米造价             （元/m2）": "25.76",
                        "造价(万元)": "24.87",
                        "造价比例（%）": "0.95",
                        "项目名称": "通风空调工程"
                    },
                    {
                        "平方米造价             （元/m2）": "-",
                        "造价(万元)": "-",
                        "造价比例（%）": "-",
                        "项目名称": "智能化系统工程"
                    },
                    {
                        "平方米造价             （元/m2）": "68.94",
                        "造价(万元)": "66.55",
                        "造价比例（%）": "2.54",
                        "项目名称": "电梯工程"
                    },
                    {
                        "平方米造价             （元/m2）": "-",
                        "造价(万元)": "-",
                        "造价比例（%）": "-",
                        "项目名称": "其他工程"
                    }
                ],
                "工程造价指标汇总": [
                    {
                        "平方米造价             （元/m2）": "2187.92",
                        "造价(万元)": "2112.13",
                        "造价比例（%）": "80.46",
                        "项目名称": "分部分项工程"
                    },
                    {
                        "平方米造价             （元/m2）": "914.93",
                        "造价(万元)": "883.24",
                        "造价比例（%）": "33.65",
                        "项目名称": "建筑工程"
                    },
                    {
                        "平方米造价             （元/m2）": "664.31",
                        "造价(万元)": "641.3",
                        "造价比例（%）": "24.43",
                        "项目名称": "装饰装修工程"
                    },
                    {
                        "平方米造价             （元/m2）": "608.68",
                        "造价(万元)": "587.59",
                        "造价比例（%）": "22.38",
                        "项目名称": "安装工程"
                    },
                    {
                        "平方米造价             （元/m2）": "328.41",
                        "造价(万元)": "317.03",
                        "造价比例（%）": "12.08",
                        "项目名称": "措施项目"
                    },
                    {
                        "平方米造价             （元/m2）": "3.31",
                        "造价(万元)": "3.2",
                        "造价比例（%）": "0.12",
                        "项目名称": "其他项目"
                    },
                    {
                        "平方米造价             （元/m2）": "108.16",
                        "造价(万元)": "104.41",
                        "造价比例（%）": "3.98",
                        "项目名称": "规费"
                    },
                    {
                        "平方米造价             （元/m2）": "91.42",
                        "造价(万元)": "88.25",
                        "造价比例（%）": "3.36",
                        "项目名称": "税金"
                    }
                ],
                "措施项目造价指标": [
                    {
                        "平方米造价             （元/m2）": "53.73",
                        "造价(万元)": "51.87",
                        "造价比例（%）": "1.98",
                        "项目名称": "安全防护文明施工措施费"
                    },
                    {
                        "平方米造价             （元/m2）": "1.26",
                        "造价(万元)": "1.22",
                        "造价比例（%）": "0.05",
                        "项目名称": "环境保护"
                    },
                    {
                        "平方米造价             （元/m2）": "9.19",
                        "造价(万元)": "8.87",
                        "造价比例（%）": "0.34",
                        "项目名称": "文明施工"
                    },
                    {
                        "平方米造价             （元/m2）": "38.76",
                        "造价(万元)": "37.42",
                        "造价比例（%）": "1.43",
                        "项目名称": "临时设施"
                    },
                    {
                        "平方米造价             （元/m2）": "4.52",
                        "造价(万元)": "4.36",
                        "造价比例（%）": "0.17",
                        "项目名称": "安全施工"
                    },
                    {
                        "平方米造价             （元/m2）": "4.22",
                        "造价(万元)": "4.07",
                        "造价比例（%）": "0.16",
                        "项目名称": "大型机械进出场及安拆"
                    },
                    {
                        "平方米造价             （元/m2）": "213.42",
                        "造价(万元)": "206.03",
                        "造价比例（%）": "7.85",
                        "项目名称": "现浇砼与钢砼构件模板"
                    },
                    {
                        "平方米造价             （元/m2）": "32.14",
                        "造价(万元)": "31.03",
                        "造价比例（%）": "1.18",
                        "项目名称": "脚手架"
                    },
                    {
                        "平方米造价             （元/m2）": "20.6",
                        "造价(万元)": "19.89",
                        "造价比例（%）": "0.76",
                        "项目名称": "垂直运输机械"
                    },
                    {
                        "平方米造价             （元/m2）": "-",
                        "造价(万元)": "-",
                        "造价比例（%）": "-",
                        "项目名称": "基坑支撑"
                    },
                    {
                        "平方米造价             （元/m2）": "-",
                        "造价(万元)": "-",
                        "造价比例（%）": "-",
                        "项目名称": "打拔钢板桩"
                    },
                    {
                        "平方米造价             （元/m2）": "0.52",
                        "造价(万元)": "0.5",
                        "造价比例（%）": "0.02",
                        "项目名称": "打桩场地处理"
                    },
                    {
                        "平方米造价             （元/m2）": "0.2",
                        "造价(万元)": "0.19",
                        "造价比例（%）": "0.01",
                        "项目名称": "施工排水、降水"
                    },
                    {
                        "平方米造价             （元/m2）": "3.57",
                        "造价(万元)": "3.45",
                        "造价比例（%）": "0.13",
                        "项目名称": "其他措施费"
                    }
                ]
            }
        }
    },
    "工程特征": {
        "工程特征": {
            "建筑工程特征": [
                {
                    "特征值": "大开挖",
                    "特征项": "土（石）方工程"
                },
                {
                    "特征值": "先张法预应力混凝土空心方桩PHS-AB450(250)",
                    "特征项": "桩与地基基础工程"
                },
                {
                    "特征值": "200厚混凝土空心砌块",
                    "特征项": "外墙类型"
                },
                {
                    "特征值": "200厚、100厚加气混凝土砌块",
                    "特征项": "内墙类型"
                },
                {
                    "特征值": "地下筏板基础，C30、C40泵送砼，Ⅲ级钢筋",
                    "特征项": "混凝土及钢筋混凝土工程（基础类型）"
                },
                {
                    "特征值": "-",
                    "特征项": "厂库房大门、特种门、木结构工程"
                },
                {
                    "特征值": "-",
                    "特征项": "金属结构工程"
                },
                {
                    "特征值": "双层3mm厚SBS防水卷材",
                    "特征项": "屋面及防水工程"
                },
                {
                    "特征值": "外墙：外侧3.5cm无机保温砂浆、内侧2cm无机保温砂浆厚度，屋面：80厚泡沫玻璃保温板",
                    "特征项": "防腐、隔热、保温工程"
                },
                {
                    "特征值": "-",
                    "特征项": "其他工程"
                },
                {
                    "特征值": "走道：玻化地砖、房间：仿木纹地砖、卫生间：防滑地砖",
                    "特征项": "楼地面工程"
                },
                {
                    "特征值": "断桥隔热铝合金门窗（6mm高透光Low-E+12空气+6mm透明）",
                    "特征项": "门窗工程"
                },
                {
                    "特征值": "水泥砂浆、装饰石膏砂浆",
                    "特征项": "墙柱面工程"
                },
                {
                    "特征值": "混合砂浆、乳胶漆一底二度",
                    "特征项": "天棚工程"
                },
                {
                    "特征值": "红色拉毛砖、部分外墙真石漆",
                    "特征项": "油漆、涂料、裱糊工程"
                },
                {
                    "特征值": "-",
                    "特征项": "其他工程"
                },
                {
                    "特征值": "照明系统、防雷接地系统",
                    "特征项": "电气工程"
                },
                {
                    "特征值": "给水、排水、雨水系统",
                    "特征项": "给排水、采暖、燃气工程工程"
                },
                {
                    "特征值": "消火栓系统、喷淋系统",
                    "特征项": "消防工程"
                },
                {
                    "特征值": "-",
                    "特征项": "通风空调工程"
                },
                {
                    "特征值": "电话、电视、门禁系统",
                    "特征项": "智能化系统工程"
                },
                {
                    "特征值": "-",
                    "特征项": "电梯工程"
                },
                {
                    "特征值": "-",
                    "特征项": "其他工程"
                }
            ]
        }
    }
}

def file_name(file_dir):
    l = []
    for root,dirs,files in os.walk(file_dir):
        l.extend(files)
    return l

#def dict_extract(check_key, var,curr_pos = None):
#
#    if curr_pos == None:
#        curr_pos = []
#    if isinstance(var,dict):
#        for k, v in var.items():
#            #if v == check_key:
#            #    curr_pos.append(k)
#            #    yield curr_pos[:]
#            if isinstance(v, dict):
#                curr_pos.append(k)
#                for result in dict_extract(check_key,v,curr_pos):
#                    yield result
#        if len(curr_pos)>0:
#            curr_pos.pop()

def dict_extract(var,curr_pos = None):

    if curr_pos == None:
        curr_pos = []
    if isinstance(var,dict):
        for k, v in var.items():
            if not isinstance(v,dict):
                curr_pos.append(k)
                yield curr_pos[:]
            if isinstance(v, dict):
                curr_pos.append(k)
                for result in dict_extract(v,curr_pos):
                    yield result
        if len(curr_pos)>0:
            curr_pos.pop()

#def record_value_path(key,dict_value,result_list=None):
#    if not result_list:
#        result_list=[]
#    for ind,i in enumerate(dict_extract(key,dict_value)):
#        result_list.extend(i)
#    return result_list

def record_value_path(dict_value,result_list=None):
    if not result_list:
        result_list=[]
    for ind,i in enumerate(dict_extract(dict_value)):
        print(i)
        result_list.extend(i)
    #print(result_list)
    return result_list

#record_value_path(dict_value)

def bfs(dict_value):
    queue = []
    queue.append(dict_value)
    while queue:
        node = queue.pop(0)
        for key in node.keys():
            value = node[key]
            if not isinstance(value,dict):
                paths = record_value_path(value,dict_value)
                yield paths
            if isinstance(value,dict):
                queue.append(value)


datas = []
def bfs_file(dict_value,path_list):
    if not path_list:
        path_list = []
    for key in dict_value.keys():
        if key == "工程概况":
            continue
        if not isinstance(dict_value[key],dict):
            path_list.append(key)
            yield datas
        else:
            path_list.append(key)
            bfs_file(dict_value[key])

#bfs_file(dict_value)
#print(datas)


def dfs(dict_value):
    pass

def getpath(nested_dict,prepath=None):
    if not prepath:
        prepath = ()
    for k,v in nested_dict.items():
        path = prepath + (k,)
        if not isinstance(v,dict): # found value
            yield path # yield the value
        elif hasattr(v, 'items'):
            yield from getpath(v,path) # yield all paths from recursive call

#for path in getpath(dict_value):
#    print(list(path))


def gen_result():
    for file_s in file_name('E:\\工作\\万邦\\工作成果\\crawler_project\\wangban_utils\\guanglianda\\办公'):
        filepath = 'E:\\工作\\万邦\\工作成果\\crawler_project\\wangban_utils\\guanglianda\\办公'
        filename = os.path.join(filepath,file_s)
        print(filename)
        with open(filename,'r',encoding='utf-8') as file:
            data = json.load(file)
            #for key,value in data.items():
            data.pop('工程概况')
            data.pop('_id')
            data.pop('model')
            for item in getpath(data):
                with open('table_head_2.txt','a') as file_work:
                    content = str(list(item))
                    file_work.write(content+';'+'\n')
        

#gen_result()

def filter_table_head():
    filter_queue = set()
    with open('E:\\工作\\万邦\\工作成果\\crawler_project\\wangban_utils\\table_head_2.txt','r') as file:
        content = file.read()
        content = re.sub(r'\s+','',content)
        content = re.sub(r'\d+','',content)
        content = re.sub(r'\\','',content)
        content = re.sub('s','',content)
        for item in content.split(';'):
            filter_queue.add(item)
    return filter_queue

#filter_table_head()  

def xls_wr(list_queue):
    workbook = xlwt.Workbook(encoding = 'utf-8')
    # 创建一个worksheet
    worksheet = workbook.add_sheet('table_names')
    # 写入excel
    # 参数对应 行, 列, 值
    for row,data_item in enumerate(list_queue):
        if data_item == '':
            continue
        data = eval(data_item)
        #print(data[1:])
        if not data:
            continue
        for column,value in enumerate(data[1:]):
            worksheet.write(row,column,value)
    # 保存
    workbook.save('table_2.xls')
    #运行后 会在当前目录生成一个Excel_test.xls
#xls_wr(list(filter_table_head()))


class Vividict(dict):
    def __missing__(self, key):
        value = self[key] = type(self)()
        return value

    def walk(self):
        for key, value in self.items():
            if isinstance(value, Vividict):
                for tup in value.walk():
                    yield (key,) + tup
            else:
                yield key

#d = Vividict(dict_value)
#
#for tup in d.walk():
#    print(tup)
#
#
#def getpath(nested_dict,prepath=None):
#    if not prepath:
#        prepath = ()
#    for k,v in nested_dict.items():
#        path = prepath + (k,)
#        if not isinstance(v,dict): # found value
#            yield path # yield the value
#        elif hasattr(v, 'items'):
#            yield from getpath(v,path) # yield all paths from recursive call
#
#for path in getpath(dict_value):
#    print(path)
#    # do stuff with path